import React from 'react'
import FaqItem from '../FaqItem/FaqItem'
import styles from './FaqList.module.css'
import BannerText from '../../../components/banner/BannerText/BannerText'

const faqData = [
  {
    question: 'Чи можна мити вашу кераміку в посудомийній машині?',
    answer:
      'Оскільки це ручна робота, ми рекомендуємо делікатне ручне миття, щоб зберегти глибину кольору глазурі на довгі роки.',
  },
  {
    question: 'Чи підходить цей посуд для використання у мікрохвильовій печі?',
    answer:
      'Так, наша кераміка проходить високотемпературний випал, тому її можна безпечно використовувати в мікрохвильовій печі.',
  },
  {
    question: 'Чи безпечні глазурі для контакту з їжею?',
    answer:
      'Так, ми використовуємо виключно сертифіковані харчові глазурі, які не містять свинцю чи інших шкідливих домішок.',
  },
  {
    question: 'Чому мій виріб трохи відрізняється від того, що на фото?',
    answer:
      'Кожен виріб WildBLOOM створюється вручну. Незначні відмінності у формі або відтінку глазурі є свідченням унікальності та автентичності ручної роботи.',
  },
  {
    question: 'Чи можна замовити індивідуальний дизайн або напис?',
    answer:
      'Ми відкриті до індивідуальних замовлень. Напишіть нам у месенджери або на пошту, щоб обговорити вашу ідею та терміни виконання.',
  },
  {
    question: 'Наскільки надійно ви пакуєте кераміку для пересилання?',
    answer:
      'Ми використовуємо багаторівневе пакування з використанням екологічних наповнювачів та щільного картону, щоб гарантувати цілісність виробу при доставці.',
  },
  {
    question: 'Що робити, якщо виріб розбився під час доставки?',
    answer:
      'Ми несемо повну відповідальність за доставку. У разі пошкодження при транспортуванні ми надішлемо вам новий виріб або повернемо кошти.',
  },
  {
    question: 'Як довго чекати на замовлення, якщо товару немає в наявності?',
    answer:
      'Створення кераміки — це тривалий процес (ліпка, сушка, два випали). Зазвичай виготовлення займає від 14 до 21 робочого дня.',
  },
  {
    question: 'Звідки ви берете натхнення для форм та кольорів?',
    answer:
      'Наше головне джерело натхнення — природа Закарпаття. Кольори гірського неба, текстура кори дерев та дикі квіти знаходять своє відображення у кожній колекції.',
  },
]

const FaqList = () => {
  return (
    <section className={styles.faqSection}>
      <div className={styles.container}>
        <BannerText title="FAQs" align="center" />
        <div className={styles.list}>
          {faqData.map((item, index) => (
            <FaqItem key={index} {...item} />
          ))}
        </div>
      </div>
    </section>
  )
}

export default FaqList
